Repository: Gosayram/jabook
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Search Audiobooks
ru: Поиск аудиокниг

# searchPlaceholder
source: Enter title, author, or keywords
ru: Введите название, автора или ключевые слова

# libraryTitle
source: Library
ru: Библиотека

# playerTitle
source: Player
ru: Плеер

# settingsTitle
source: Settings
ru: Настройки

# debugTitle
source: Debug
ru: Отладка

# mirrorsTitle
source: Mirrors
ru: Зеркала

# topicTitle
source: Topic
ru: Топик

# noResults
source: No results found
ru: Результатов не найдено

# noResultsForFilters
source: No results match the selected filters
ru: Нет результатов для выбранных фильтров

source: Loading...
ru: Загрузка...

source: Error
ru: Ошибка

source: Retry
ru: Повторить

source: Language
ru: Язык

source: English
ru: Английский

source: Russian
ru: Русский

source: System Default
ru: Системный по умолчанию

source: Failed to search
ru: Не удалось выполнить поиск

source: Results from cache
ru: Результаты из кэша

# resultsFromLocalDb
source: Results from local database
ru: Результаты из локальной базы данных

# enterSearchTerm
source: Enter a search term to begin
ru: Введите поисковый запрос чтобы начать

# authorLabel
source: Author:
ru: Автор:

# sizeLabel
source: Size:
ru: Размер:

# seedersLabel
source: seeders
ru: сидеров

# leechersLabel
source: leechers
ru: личеров

source: Unknown Title
ru: Неизвестное название

source: Unknown Author
ru: Неизвестный автор

source: Unknown Size
ru: Неизвестный размер

# addBookComingSoon
source: Add book functionality coming soon!
ru: Функция добавления книг скоро появится!

# libraryContentPlaceholder
source: Library content will be displayed here
ru: Содержимое библиотеки будет отображаться здесь

source: Authentication Required
ru: Требуется аутентификация

# loginRequiredForSearch
source: Please login to RuTracker to access search functionality.
ru: Пожалуйста, войдите в RuTracker для доступа к функции поиска.

source: Cancel
ru: Отмена

source: Reset
ru: Сбросить

source: Reset to global settings
ru: Сбросить до глобальных настроек

source: Reset all book settings
ru: Сбросить настройки всех книг

# resetAllBookSettingsDescription
source: Remove individual settings for all books
ru: Удалить индивидуальные настройки для всех книг

# resetAllBookSettingsConfirmation
source: This will remove individual audio settings for all books. All books will use global settings. This action cannot be undone.
ru: Это удалит индивидуальные аудио-настройки для всех книг. Все книги будут использовать глобальные настройки. Это действие нельзя отменить.

# settingsResetToGlobal
source: Settings reset to global defaults
ru: Настройки сброшены до глобальных

# allBookSettingsReset
source: All book settings have been reset to global defaults
ru: Все настройки книг сброшены до глобальных

source: Error resetting settings
ru: Ошибка при сбросе настроек

source: Login
ru: Войти

# networkConnectionError
source: Could not connect. Check your internet or choose another mirror in Settings → Sources.
ru: Не удалось подключиться. Проверьте интернет или выберите другое зеркало в Настройках → Источники.

# connectionFailed
source: Connection failed. Please check your internet connection or try a different mirror.
ru: Соединение не установлено. Проверьте интернет-подключение или попробуйте другое зеркало.

source: Choose Mirror
ru: Выбрать зеркало

# networkErrorUser
source: Network connection issue
ru: Проблема с сетевым подключением

# dnsError
source: Could not resolve domain. This may be due to network restrictions or an inactive mirror.
ru: Не удалось разрешить домен. Это может быть связано с сетевыми ограничениями или неактивным зеркалом.

# timeoutError
source: Request took too long. Please check your connection and try again.
ru: Запрос занял слишком много времени. Проверьте соединение и попробуйте снова.

# serverError
source: Server is temporarily unavailable. Please try again later or choose another mirror.
ru: Сервер временно недоступен. Попробуйте позже или выберите другое зеркало.

source: Recent Searches
ru: Недавние поиски

# searchExamples
source: Try these examples
ru: Попробуйте эти примеры

source: Quick Actions
ru: Быстрые действия

source: Scan Local Files
ru: Сканировать локальные файлы

source: Feature coming soon
ru: Функция скоро появится

source: Change Mirror
ru: Сменить зеркало

source: Check Connection
ru: Проверить соединение

source: Permissions Required
ru: Требуются разрешения

# permissionExplanation
source: This app needs storage permission to download and save audiobook files. Please grant the required permissions to continue.
ru: Это приложение требует разрешения на хранение для загрузки и сохранения аудиофайлов. Пожалуйста, предоставьте необходимые разрешения для продолжения.

source: Grant Permissions
ru: Предоставить разрешения

# permissionDeniedTitle
source: Permission Denied
ru: В разрешении отказано

# permissionDeniedMessage
source: Storage permission is required to download files. Please enable it in app settings.
ru: Для загрузки файлов требуется разрешение на хранение. Пожалуйста, включите его в настройках приложения.

# permissionDeniedButton
source: Open Settings
ru: Открыть настройки

# navLibrary
source: Library
ru: Библиотека

# navAuth
source: Connect
ru: Аутентификация

# navSearch
source: Search
ru: Поиск

# navSettings
source: Settings
ru: Настройки

# navDebug
source: Debug
ru: Отладка

# authTitle
source: Login
ru: Вход

# usernameLabel
source: Username
ru: Имя пользователя

# passwordLabel
source: Password
ru: Пароль

# rememberMeLabel
source: Remember me
ru: Запомнить меня

# loginButton
source: Login
ru: Войти

# testConnectionButton
source: Test Connection
ru: Проверить соединение

# logoutButton
source: Logout
ru: Выйти

source: Cache cleared successfully
ru: Кэш успешно очищен

source: Download status unknown
ru: Статус загрузки неизвестен

source: Failed to export logs
ru: Не удалось экспортировать логи

source: Logs exported successfully
ru: Логи успешно экспортированы

source: Mirror health check completed
ru: Проверка здоровья зеркал завершена

source: Test All Mirrors
ru: Проверить все зеркала

# statusLabel
source: Status:
ru: Статус:

# lastOkLabel
source: Last OK:
ru: Последний OK:

# milliseconds
source: ms
ru: мс

# downloadLabel
source: Download
ru: Загрузка

# statusLabelNoColon
source: Status
ru: Статус

# downloadProgressLabel
source: Progress
ru: Прогресс

source: Cache Statistics
ru: Статистика кэша

source: Total entries
ru: Всего записей

source: Search cache
ru: Кэш поиска

source: Topic cache
ru: Кэш топиков

source: Memory usage
ru: Использование памяти

source: Clear All Cache
ru: Очистить весь кэш

# mirrorsScreenTitle
source: Mirrors
ru: Зеркала

source: Failed to load audio
ru: Не удалось загрузить аудио

# chaptersLabel
source: Chapters
ru: Главы

source: Download functionality coming soon
ru: Функция загрузки скоро появится

source: Request timed out
ru: Время запроса истекло

source: Network error
ru: Сетевая ошибка

# mirrorStatusDisabled
source: Disabled
ru: Отключено

# mirrorResponseTime
source: Response time
ru: Время отклика

# mirrorLastCheck
source: Last check
ru: Последняя проверка

# mirrorTestIndividual
source: Test individual mirror
ru: Проверить отдельное зеркало

# activeStatus
source: Active
ru: Активно

# disabledStatus
source: Disabled
ru: Отключено

# languageDescription
source: Select language
ru: Выберите язык

# themeTitle
source: Theme
ru: Тема

# themeDescription
source: Select app theme
ru: Выберите тему приложения

source: Dark mode
ru: Темный режим

source: High contrast
ru: Высокая контрастность

# audioTitle
source: Audio
ru: Аудио

# audioDescription
source: Audio settings
ru: Настройки аудио

# audioEnhancementTitle
source: Audio Enhancement
ru: Улучшение звука

# audioEnhancementDescription
source: Improve audio quality and volume consistency
ru: Улучшение качества звука и стабильности громкости

# normalizeVolumeTitle
source: Normalize Volume
ru: Нормализация громкости

# normalizeVolumeDescription
source: Maintain consistent volume across different audiobooks
ru: Поддержание стабильной громкости для разных аудиокниг

# volumeBoostTitle
source: Volume Boost
ru: Усиление громкости

# drcLevelTitle
source: Dynamic Range Compression
ru: Компрессия динамического диапазона

# speechEnhancerTitle
source: Speech Enhancer
ru: Улучшение речи

# speechEnhancerDescription
source: Improve speech clarity and reduce sibilance
ru: Улучшение четкости речи и уменьшение шипящих звуков

# autoVolumeLevelingTitle
source: Auto Volume Leveling
ru: Автоматическое выравнивание громкости

# autoVolumeLevelingDescription
source: Automatically adjust volume to maintain consistent level
ru: Автоматическая регулировка громкости для поддержания стабильного уровня

source: Playback speed
ru: Скорость воспроизведения

source: Skip duration
ru: Длительность пропуска

# downloadsTitle
source: Downloads
ru: Загрузки

# downloadsDescription
source: Download settings
ru: Настройки загрузки

source: Download location
ru: Место загрузки

source: WiFi only downloads
ru: Загрузки только по Wi-Fi

source: Data loaded from cache
ru: Данные загружены из кэша

source: Failed to load topic
ru: Не удалось загрузить топик

# magnetLinkLabel
source: Magnet link
ru: Magnet-ссылка

source: Unknown chapter
ru: Неизвестная глава

source: Magnet link copied
ru: Magnet-ссылка скопирована

# copyToClipboardLabel
source: Copy to clipboard
ru: Скопировать в буфер

# debugToolsTitle
source: Debug Tools
ru: Инструменты отладки

# logsTab
source: Logs
ru: Логи

# mirrorsTab
source: Mirrors
ru: Зеркала

# downloadsTab
source: Downloads
ru: Загрузки

# cacheTab
source: Cache
ru: Кэш

# testAllMirrorsButton
source: Test All Mirrors
ru: Проверить все зеркала

# statusLabelText
source: Status:
ru: Статус:

# lastOkLabelText
source: Last OK:
ru: Последний OK:

# millisecondsText
source: ms
ru: мс

# downloadLabelText
source: Download
ru: Загрузка

# statusLabelNoColonText
source: Status
ru: Статус

# downloadProgressLabelText
source: Progress
ru: Прогресс

# cacheStatisticsTitle
source: Cache Statistics
ru: Статистика кэша

# totalEntriesText
source: Total entries:
ru: Всего записей:

# searchCacheText
source: Search cache:
ru: Кэш поиска:

# topicCacheText
source: Topic cache:
ru: Кэш топиков:

# memoryUsageText
source: Memory usage:
ru: Использование памяти:

# clearAllCacheButton
source: Clear All Cache
ru: Очистить весь кэш

# cacheIsEmptyMessage
source: Cache is empty
ru: Кэш пуст

# refreshDebugDataButton
source: Refresh Debug Data
ru: Обновить данные отладки

# exportLogsButton
source: Export Logs
ru: Экспортировать логи

# deleteDownloadButton
source: Delete Download
ru: Удалить загрузку

# doneButtonText
source: Done
ru: Готово

# webViewLoginInstruction
source: Please log in to RuTracker. After successful login, tap Done to extract cookies for the client.
ru: Войдите в RuTracker. После успешного входа нажмите «Готово», чтобы извлечь cookie для клиента.

# cloudflareMessage
source: This site uses Cloudflare security checks. Please wait for the check to complete and interact with the page that opens if needed.
ru: Этот сайт использует проверки безопасности Cloudflare. Пожалуйста, дождитесь завершения проверки и взаимодействуйте с открывшейся страницей при необходимости.

# retryButtonText
source: Retry
ru: Повторить

# goHomeButtonText
source: Go to Home
ru: Перейти на главную

# browserCheckMessage
source: The site is checking your browser - please wait for the check to complete on this page.
ru: Сайт проверяет ваш браузер - пожалуйста, дождитесь завершения проверки на этой странице.

# downloadTorrentTitle
source: Download Torrent
ru: Скачать торрент

# selectActionText
source: Select action:
ru: Выберите действие:

# openButtonText
source: Open
ru: Открыть

# downloadButtonText
source: Download
ru: Скачать

# downloadInBrowserMessage
source: To download the file, please open the link in your browser
ru: Чтобы скачать файл, пожалуйста, откройте ссылку в браузере

# importAudiobooksTitle
source: Import Audiobooks
ru: Импортировать аудиокниги

# selectFilesMessage
source: Select audiobook files from your device to add to your library
ru: Выберите файлы аудиокниг с вашего устройства для добавления в библиотеку

# importButtonText
source: Import
ru: Импортировать

# importedSuccess
source: Imported $count audiobook(s)
ru: Импортировано $count аудиокнига(и)

# noFilesSelectedMessage
source: No files selected
ru: Файлы не выбраны

# importFailedMessage
source: Failed to import: $error
ru: Не удалось импортировать: $error

# scanFolderTitle
source: Scan Folder
ru: Сканировать папку

# scanFolderMessage
source: Scan a folder on your device for audiobook files
ru: Сканируйте папку на вашем устройстве в поисках файлов аудиокниг

# scanButtonText
source: Scan
ru: Сканировать

# scanSuccessMessage
source: Found and imported $count audiobook(s)
ru: Найдено и импортировано $count аудиокнига(и)

# noAudiobooksFoundMessage
source: No audiobook files found in selected folder
ru: В выбранной папке не найдено файлов аудиокниг

# noFolderSelectedMessage
source: No folder selected
ru: Папка не выбрана

# scanFailedMessage
source: Failed to scan folder: $error
ru: Не удалось просканировать папку: $error

# authScreenTitle
source: RuTracker Connection
ru: Подключение к RuTracker

# usernameLabelText
source: Username
ru: Имя пользователя

# passwordLabelText
source: Password
ru: Пароль

# rememberMeLabelText
source: Remember me
ru: Запомнить меня

# loginButtonText
source: Login
ru: Войти

# testConnectionButtonText
source: Test Connection
ru: Проверить соединение

# logoutButtonText
source: Logout
ru: Выйти

# loggingInText
source: Logging in...
ru: Вход в систему...

# loginSuccessMessage
source: Login successful!
ru: Вход выполнен успешно!

# loginFailedMessage
source: Login failed. Please check credentials
ru: Вход не удался. Пожалуйста, проверьте учетные данные

# loginErrorMessage
source: Login error: $error
ru: Ошибка входа: $error

# testingConnectionText
source: Testing connection...
ru: Проверка соединения...

# connectionSuccessMessage
source: Connection successful! Using: $endpoint
ru: Соединение установлено! Используется: $endpoint

# connectionFailedMessage
source: Connection test failed: $error
ru: Проверка соединения не удалась: $error

# loggingOutText
source: Logging out...
ru: Выход из системы...

# logoutSuccessMessage
source: Logout completed
ru: Выполнен выход из системы

# logoutErrorMessage
source: Logout error: $error
ru: Ошибка выхода: $error

# configureMirrorsSubtitle
source: Configure and test RuTracker mirrors
ru: Настройте и проверьте зеркала RuTracker

# playbackSpeedTitle
source: Playback Speed
ru: Скорость воспроизведения

# skipDurationTitle
source: Skip Duration
ru: Длительность пропуска

# downloadLocationTitle
source: Download Location
ru: Место загрузки

# darkModeTitle
source: Dark Mode
ru: Темный режим

# highContrastTitle
source: High Contrast
ru: Высокая контрастность

# wifiOnlyDownloadsTitle
source: WiFi Only Downloads
ru: Загрузки только по Wi-Fi

# failedToLoadMirrorsMessage
source: Failed to load mirrors: $error
ru: Не удалось загрузить зеркала: $error

# mirrorTestSuccessMessage
source: Mirror $url tested successfully
ru: Зеркало $url проверено успешно

# mirrorTestFailedMessage
source: Failed to test mirror $url: $error
ru: Не удалось проверить зеркало $url: $error

# mirrorStatusText
source: Mirror $status
ru: Зеркало $status

# failedToUpdateMirrorMessage
source: Failed to update mirror: $error
ru: Не удалось обновить зеркало: $error

# addCustomMirrorTitle
source: Add Custom Mirror
ru: Добавить зеркало

# mirrorUrlLabelText
source: Mirror URL
ru: URL зеркала

# priorityLabelText
source: Priority (1-10)
ru: Приоритет (1-10)

# addMirrorButtonText
source: Add
ru: Добавить

# mirrorAddedMessage
source: Mirror $url added
ru: Зеркало $url добавлено

# failedToAddMirrorMessage
source: Failed to add mirror: $error
ru: Не удалось добавить зеркало: $error

# mirrorSettingsTitle
source: Mirror Settings
ru: Настройки зеркал

# mirrorSettingsDescription
source: Configure RuTracker mirrors for optimal search performance. Enabled mirrors will be used automatically.
ru: Настройте зеркала RuTracker для оптимальной производительности поиска. Включенные зеркала будут использоваться автоматически.

# addCustomMirrorButtonText
source: Add Custom Mirror
ru: Добавить зеркало

# priorityText
source: Priority: $priority
ru: Приоритет: $priority

# responseTimeText
source: Response time: $rtt ms
ru: Время отклика: $rtt мс

# lastCheckedText
source: Last checked: $date
ru: Последняя проверка: $date

# testMirrorButtonText
source: Test this mirror
ru: Проверить это зеркало

# activeStatusText
source: Active
ru: Активно

# disabledStatusText
source: Disabled
ru: Отключено

# neverDateText
source: Never
ru: Никогда

# invalidDateText
source: Invalid date
ru: Неверная дата

# playerScreenTitle
source: Player
ru: Плеер

# failedToLoadAudioMessage
source: Failed to load audiobook
ru: Не удалось загрузить аудиокнигу

# byAuthorText
source: by: $author
ru: автор: $author

# chaptersLabelText
source: Chapters
ru: Главы

# downloadFunctionalityComingSoonMessage
source: Download functionality coming soon!
ru: Функция загрузки скоро появится!

# sampleTitleText
source: Sample Audiobook
ru: Пример аудиокниги

# sampleAuthorText
source: Sample Author
ru: Пример автора

# sampleCategoryText
source: Fiction
ru: Художественная

# sampleSizeText
source: 150 MB
ru: 150 МБ

# sampleChapter1Text
source: Chapter 1
ru: Глава 1

# sampleChapter2Text
source: Chapter 2
ru: Глава 2

# topicScreenTitle
source: Topic
ru: Топик

# requestTimedOutMessage
source: Request timed out. Check your connection.
ru: Время запроса истекло. Проверьте соединение.

# networkErrorMessage
source: Network error: $error
ru: Сетевая ошибка: $error

# errorLoadingTopicMessage
source: Error loading topic: $error
ru: Ошибка загрузки топика: $error

# failedToLoadTopicMessage
source: Failed to load topic
ru: Не удалось загрузить топик

# dataLoadedFromCacheMessage
source: Data loaded from cache
ru: Данные загружены из кэша

# unknownChapterText
source: Unknown chapter
ru: Неизвестная глава

# magnetLinkLabelText
source: Magnet link
ru: Magnet-ссылка

# magnetLinkCopiedMessage
source: Magnet link copied to clipboard
ru: Magnet-ссылка скопирована в буфер обмена

# copyToClipboardMessage
source: $label copied to clipboard
ru: $label скопирован в буфер обмена

# navLibraryText
source: Library
ru: Библиотека

# navAuthText
source: Connect
ru: Подключение

# navSearchText
source: Search
ru: Поиск

# navSettingsText
source: Settings
ru: Настройки

# navDebugText
source: Debug
ru: Отладка

# authDialogTitle
source: Login
ru: Вход

# authHelpText
source: Login to RuTracker to access audiobook search and downloads. Your credentials are stored securely.
ru: Войдите в RuTracker для доступа к поиску и загрузке аудиокниг. Ваши учетные данные хранятся в безопасности.

# cacheClearedSuccessfullyMessage
source: Cache cleared successfully
ru: Кэш успешно очищен

# downloadStatusUnknownMessage
source: Download status unknown
ru: Статус загрузки неизвестен

# failedToExportLogsMessage
source: Failed to export logs
ru: Не удалось экспортировать логи

# logsExportedSuccessfullyMessage
source: Logs exported successfully
ru: Логи успешно экспортированы

# mirrorHealthCheckCompletedMessage
source: Mirror health check completed: $tested/$total mirrors
ru: Проверка завершена: $tested/$total зеркал

# noActiveMirrorsMessage
source: No active mirrors to test
ru: Нет активных зеркал для проверки

# activeMirrorSetMessage
source: Active mirror set: $url
ru: Активное зеркало установлено: $url

# failedToSetActiveMirrorMessage
source: Failed to set active mirror: $error
ru: Не удалось установить активное зеркало: $error

# activeMirrorText
source: Active mirror: $url
ru: Активное зеркало: $url

# failedToSetBestMirrorMessage
source: Failed to set best mirror: $error
ru: Не удалось установить лучшее зеркало: $error

# activeMirrorDisabledMessage
source: Active mirror disabled. Switched to: $url
ru: Активное зеркало отключено. Переключено на: $url

# warningFailedToSelectNewActiveMirrorMessage
source: Warning: failed to select new active mirror: $error
ru: Предупреждение: не удалось выбрать новое активное зеркало: $error

# urlCopiedToClipboardMessage
source: URL copied to clipboard
ru: URL скопирован в буфер обмена

# editPriorityTitle
source: Edit Priority
ru: Изменить приоритет

# priorityHelperText
source: Lower number = higher priority
ru: Меньше число = выше приоритет

# saveButtonText
source: Save
ru: Сохранить

# priorityUpdatedMessage
source: Priority updated: $priority
ru: Приоритет обновлен: $priority

# failedToUpdatePriorityMessage
source: Failed to update priority: $error
ru: Не удалось обновить приоритет: $error

# deleteMirrorTitle
source: Delete Mirror?
ru: Удалить зеркало?

# defaultMirrorWarningMessage
source: Warning: this is a default mirror. It will be removed from the list, but can be added again.
ru: Внимание: это зеркало по умолчанию. Оно будет удалено из списка, но может быть добавлено снова.

# confirmDeleteMirrorMessage
source: Are you sure you want to delete this mirror?
ru: Вы уверены, что хотите удалить это зеркало?

# deleteButtonText
source: Delete
ru: Удалить

# mirrorDeletedMessage
source: Mirror deleted: $url
ru: Зеркало удалено: $url

# failedToDeleteMirrorMessage
source: Failed to delete mirror: $error
ru: Не удалось удалить зеркало: $error

# urlMustStartWithHttpMessage
source: URL must start with http:// or https://
ru: URL должен начинаться с http:// или https://

# invalidUrlFormatMessage
source: Invalid URL format
ru: Неверный формат URL

# mirrorAlreadyExistsMessage
source: This mirror already exists in the list
ru: Это зеркало уже существует в списке

# onlyActiveFilterText
source: Only Active
ru: Только активные

# onlyHealthyFilterText
source: Only Healthy
ru: Только здоровые

# sortByPriorityText
source: By Priority
ru: По приоритету

# sortByHealthText
source: By Health
ru: По здоровью

# sortBySpeedText
source: By Speed
ru: По скорости

# noMirrorsMatchFiltersMessage
source: No mirrors match the filters
ru: Нет зеркал, соответствующих фильтрам

# setBestMirrorButtonText
source: Set Best Mirror
ru: Установить лучшее зеркало

# healthScoreText
source: Health: $score%
ru: Здоровье: $score%

# setAsActiveTooltip
source: Set as active
ru: Установить как активное

# copyUrlTooltip
source: Copy URL
ru: Копировать URL

# deleteMirrorTooltip
source: Delete mirror
ru: Удалить зеркало

# activeLabelText
source: Active
ru: Активно

# failedToClearCacheMessage
source: Failed to clear cache: $error
ru: Не удалось очистить кэш: $error

# failedToTestMirrorsMessage
source: Failed to test mirrors: $error
ru: Не удалось проверить зеркала: $error

# mirrorStatusDegraded
source: Degraded
ru: Деградировано

# mirrorStatusUnhealthy
source: Unhealthy
ru: Неисправно

# pleaseEnterCredentials
source: Please enter username and password
ru: Пожалуйста, введите имя пользователя и пароль

# favoritesTitle
source: Favorites
ru: Избранное

# refreshTooltip
source: Refresh
ru: Обновить

# noFavoritesMessage
source: No favorite audiobooks
ru: Нет избранных аудиокниг

# addFavoritesHint
source: Add audiobooks to favorites from search results
ru: Добавьте аудиокниги в избранное из результатов поиска

# goToSearchButton
source: Go to Search
ru: Перейти к поиску

source: Added to favorites
ru: Добавлено в избранное

source: Removed from favorites
ru: Удалено из избранного

source: Failed to remove from favorites
ru: Не удалось удалить из избранного

# favoritesTooltip
source: Favorites
ru: Избранное

# filterLibraryTooltip
source: Filter library
ru: Фильтр библиотеки

# addAudiobookTooltip
source: Add audiobook
ru: Добавить аудиокнигу

# libraryEmptyMessage
source: Your library is empty
ru: Ваша библиотека пуста
