Repository: Gosayram/jabook
Catalog: lib/l10n/app_*.arb
Languages: ru

# addAudiobooksHint
source: Add audiobooks to your library to start listening
ru: Добавьте аудиокниги в библиотеку, чтобы начать прослушивание

# searchForAudiobooksButton
source: Search for audiobooks
ru: Поиск аудиокниг

# importFromFilesButton
source: Import from Files
ru: Импорт из файлов

# biometricAuthInProgress
source: Please wait, biometric authentication in progress...
ru: Подождите, выполняется биометрическая аутентификация...

source: Authorization successful
ru: Авторизация успешна

# authorizationTitle
source: Authorization
ru: Авторизация

# biometricUnavailableMessage
source: Biometric authentication is unavailable or failed. Open WebView to login?
ru: Биометрическая аутентификация недоступна или не удалась. Открыть WebView для входа?

# openWebViewButton
source: Open WebView
ru: Открыть WebView

# authorizationCheckError
source: Error checking authorization: $error
ru: Ошибка при проверке авторизации: $error

# authorizationFailedMessage
source: Authorization failed. Please check your login and password
ru: Авторизация не удалась. Проверьте логин и пароль

# authorizationPageError
source: Error opening authorization page: $error
ru: Ошибка открытия страницы авторизации: $error

# filtersLabel
source: Filters:
ru: Фильтры:

# resetButton
source: Reset
ru: Сбросить

# otherCategory
source: Other
ru: Другое

# searchHistoryTitle
source: Search History
ru: История поиска

# clearButton
source: Clear
ru: Очистить

source: Failed to add to favorites
ru: Не удалось добавить в избранное

# loadMoreButton
source: Load more
ru: Загрузить еще

# allowButton
source: Allow
ru: Разрешить

source: Copy Magnet Link
ru: Скопировать Magnet-ссылку

# downloadTorrentMenu
source: Download Torrent
ru: Скачать торрент

# openTorrentInExternalApp
source: Open torrent file in external app
ru: Открыть файл торрента во внешнем приложении

# failedToOpenTorrent
source: Failed to open torrent: $error
ru: Не удалось открыть торрент: $error

source: URL unavailable
ru: URL недоступен

# invalidUrlFormat
source: Invalid URL format: $url
ru: Неверный формат URL: $url

# genericError
source: Error: $error
ru: Ошибка: $error

# retryConnectionMessage
source: Retrying connection ($current/$max)...
ru: Повторная попытка подключения ($current/$max)...

# loadError
source: Load error: $desc
ru: Ошибка загрузки: $desc

# pageLoadError
source: An error occurred while loading the page
ru: Произошла ошибка при загрузке страницы

# securityVerificationInProgress
source: Security verification in progress - please wait...
ru: Проверка безопасности выполняется - пожалуйста, подождите...

# openInBrowserButton
source: Open in Browser
ru: Открыть в браузере

# fileWillOpenInBrowser
source: The file will be opened in browser for download
ru: Для загрузки файл будет открыт в браузере

# resetFiltersButton
source: Reset Filters
ru: Сбросить фильтры

# languageChangedMessage
source: Language changed to {languageName}
ru: Язык изменен на {languageName}

source: Follow System Theme
ru: Следовать системной теме

# rutrackerSessionDescription
source: RuTracker session management (cookie)
ru: Управление сессией RuTracker (cookie)

# loginViaWebViewButton
source: Login to RuTracker via WebView
ru: Войти в RuTracker через WebView

# loginViaWebViewSubtitle
source: Pass Cloudflare/captcha and save cookie for client
ru: Пройти Cloudflare/капчу и сохранить cookie для клиента

source: Cookies saved for HTTP client
ru: Cookie сохранены для HTTP-клиента

# clearSessionButton
source: Clear RuTracker session (cookie)
ru: Очистить сессию RuTracker (cookie)

# clearSessionSubtitle
source: Delete saved cookies and logout from account
ru: Удалить сохранённые cookie и выйти из аккаунта

# sessionClearedMessage
source: RuTracker session cleared
ru: Сессия RuTracker очищена

# metadataSectionTitle
source: Audiobook Metadata
ru: Метаданные аудиокниг

# metadataSectionDescription
source: Manage local audiobook metadata database
ru: Управление локальной базой метаданных аудиокниг

# totalRecordsLabel
source: Total records
ru: Всего записей

# lastUpdateLabel
source: Last update
ru: Последнее обновление

# updatingText
source: Updating...
ru: Обновление...

# updateMetadataButton
source: Update Metadata
ru: Обновить метаданные

# metadataUpdateStartedMessage
source: Metadata update started...
ru: Начато обновление метаданных...

# metadataUpdateCompletedMessage
source: Update completed: collected $total records
ru: Обновление завершено: собрано $total записей

# metadataUpdateError
source: Update error: $error
ru: Ошибка обновления: $error

# neverDate
source: Never
ru: Никогда

# daysAgo
source: $days days ago
ru: $days дн. назад

# hoursAgo
source: $hours hours ago
ru: $hours ч. назад

# minutesAgo
source: $minutes minutes ago
ru: $minutes мин. назад

source: Just now
ru: Только что

# unknownDate
source: Unknown
ru: Неизвестно

# skipDurationDefault
source: 15 seconds
ru: 15 секунд

# clearExpiredCacheButton
source: Clear Expired Cache
ru: Очистить устаревший кэш

# appPermissionsTitle
source: App Permissions
ru: Разрешения приложения

# storagePermissionName
source: Storage
ru: Хранилище

# storagePermissionDescription
source: Save audiobook files and cache data
ru: Сохранять файлы аудиокниг и данные кэша

# notificationsPermissionName
source: Notifications
ru: Уведомления

# notificationsPermissionDescription
source: Show playback controls and updates
ru: Показывать элементы управления воспроизведением и обновления

# grantAllPermissionsButton
source: Grant All Permissions
ru: Предоставить все разрешения

source: All permissions granted
ru: Все разрешения предоставлены

source: File access available
ru: Доступ к файлам доступен

source: File access unavailable
ru: Доступ к файлам недоступен

# storagePermissionGuidanceTitle
source: File Access Permission
ru: Разрешение на доступ к файлам

# storagePermissionGuidanceMessage
source: To access audio files, you need to grant file access permission.
ru: Для доступа к аудиофайлам необходимо предоставить разрешение на доступ к файлам.

# storagePermissionGuidanceStep1
source: 1. Open JaBook app settings
ru: 1. Откройте настройки приложения JaBook

# storagePermissionGuidanceStep2
source: 2. Go to Permissions section
ru: 2. Перейдите в раздел "Разрешения"

# storagePermissionGuidanceStep3
source: 3. Enable "Files and media" or "Storage" permission
ru: 3. Включите разрешение "Файлы и медиа" или "Хранилище"

# storagePermissionGuidanceMiuiTitle
source: File Access Permission (MIUI)
ru: Разрешение на доступ к файлам (MIUI)

# storagePermissionGuidanceMiuiMessage
source: On Xiaomi/Redmi/Poco (MIUI) devices, you need to grant file access permission:
ru: На устройствах Xiaomi/Redmi/Poco (MIUI) необходимо предоставить разрешение на доступ к файлам:

# storagePermissionGuidanceMiuiStep1
source: 1. Open Settings → Apps → JaBook → Permissions
ru: 1. Откройте Настройки → Приложения → JaBook → Разрешения

# storagePermissionGuidanceMiuiStep2
source: 2. Enable "Files and media" or "Storage" permission
ru: 2. Включите разрешение "Файлы и медиа" или "Хранилище"

# storagePermissionGuidanceMiuiStep3
source: 3. If access is limited, enable "Manage all files" in MIUI Security settings
ru: 3. Если доступ ограничен, включите "Управление всеми файлами" в настройках безопасности MIUI

# storagePermissionGuidanceMiuiNote
source: Note: On some MIUI versions, you may need to additionally enable "Manage all files" in Settings → Security → Permission management.
ru: Примечание: В некоторых версиях MIUI может потребоваться дополнительно включить "Управление всеми файлами" в Настройки → Безопасность → Управление разрешениями.

# storagePermissionGuidanceColorosTitle
source: File Access Permission (ColorOS/RealmeUI)
ru: Разрешение на доступ к файлам (ColorOS/RealmeUI)

# storagePermissionGuidanceColorosMessage
source: On Oppo/Realme (ColorOS/RealmeUI) devices, you need to grant file access permission:
ru: На устройствах Oppo/Realme (ColorOS/RealmeUI) необходимо предоставить разрешение на доступ к файлам:

# storagePermissionGuidanceColorosStep1
source: 1. Open Settings → Apps → JaBook → Permissions
ru: 1. Откройте Настройки → Приложения → JaBook → Разрешения

# storagePermissionGuidanceColorosStep2
source: 2. Enable "Files and media" permission
ru: 2. Включите разрешение "Файлы и медиа"

# storagePermissionGuidanceColorosStep3
source: 3. If access is limited, check "Files and media" settings in permissions section
ru: 3. Если доступ ограничен, проверьте настройки "Файлы и медиа" в разделе разрешений

# storagePermissionGuidanceColorosNote
source: Note: On some ColorOS versions, you may need to additionally allow file access in security settings.
ru: Примечание: В некоторых версиях ColorOS может потребоваться дополнительно разрешить доступ к файлам в настройках безопасности.

source: Open Settings
ru: Открыть настройки

# safFallbackTitle
source: Alternative File Access Method
ru: Альтернативный метод доступа к файлам

# safFallbackMessage
source: File access permissions are not working properly on your device. You can use the Storage Access Framework (SAF) to select folders manually. This method works without requiring special permissions.
ru: Разрешения на доступ к файлам не работают должным образом на вашем устройстве. Вы можете использовать Storage Access Framework (SAF) для выбора папок вручную. Этот метод работает без специальных разрешений.

# safPermissionCheckboxMessage
source: Please check the 'Allow access to this folder' checkbox in the file picker dialog and try again. Without this checkbox, the app cannot access the selected folder.
ru: Пожалуйста, отметьте чекбокс 'Разрешить доступ к этой папке' в диалоге выбора папки и попробуйте снова. Без этого чекбокса приложение не сможет получить доступ к выбранной папке.

# safNoAccessMessage
source: No access to selected folder. Please check the 'Allow access to this folder' checkbox in the file picker and try again.
ru: Нет доступа к выбранной папке. Пожалуйста, отметьте чекбокс 'Разрешить доступ к этой папке' в диалоге выбора папки и попробуйте снова.

# safFolderPickerHintTitle
source: Important: Check the checkbox
ru: Важно: Отметьте чекбокс

# safFolderPickerHintMessage
source: When selecting a folder, please make sure to check the 'Allow access to this folder' checkbox in the file picker dialog. Without this checkbox, the app cannot access the selected folder.
ru: При выборе папки обязательно отметьте чекбокс 'Разрешить доступ к этой папке' в диалоге выбора папки. Без этого чекбокса приложение не сможет получить доступ к выбранной папке.

# safAndroidDataObbWarning
source: Note: Access to Android/data and Android/obb folders is blocked on Android 11+ devices with security updates from March 2024. Please select a different folder.
ru: Примечание: Доступ к папкам Android/data и Android/obb заблокирован на устройствах Android 11+ с обновлениями безопасности от марта 2024 года. Пожалуйста, выберите другую папку.

# safFallbackBenefits
source: Benefits of using SAF: • Works on all Android devices • No special permissions needed • You choose which folders to access
ru: Преимущества использования SAF: • Работает на всех Android устройствах • Не требует специальных разрешений • Вы выбираете, к каким папкам предоставить доступ

# useSafMethod
source: Use Folder Selection
ru: Использовать выбор папок

source: Try Permissions Again
ru: Попробовать разрешения снова

source: Notifications available
ru: Уведомления доступны

source: Notifications unavailable
ru: Уведомления недоступны

# capabilitiesStatus
source: Capabilities: $grantedCount/$total
ru: Возможности: $grantedCount/$total

# backupRestoreTitle
source: Backup & Restore
ru: Резервное копирование и восстановление

# backupRestoreDescription
source: Export and import your data (favorites, history, metadata)
ru: Экспорт и импорт ваших данных (избранное, история, метаданные)

# exportDataButton
source: Export Data
ru: Экспортировать данные

# exportDataSubtitle
source: Save all your data to a backup file
ru: Сохранить все ваши данные в файл резервной копии

# importDataButton
source: Import Data
ru: Импортировать данные

# importDataSubtitle
source: Restore data from a backup file
ru: Восстановить данные из файла резервной копии

# exportingDataMessage
source: Exporting data...
ru: Экспорт данных...

# dataExportedSuccessfullyMessage
source: Data exported successfully
ru: Данные успешно экспортированы

# failedToExportMessage
source: Failed to export: $error
ru: Не удалось экспортировать: $error

# importBackupTitle
source: Import Backup
ru: Импорт резервной копии

# importBackupConfirmationMessage
source: This will import data from the backup file. Existing data may be merged or replaced. Continue?
ru: Это импортирует данные из файла резервной копии. Существующие данные могут быть объединены или заменены. Продолжить?

# importButton
source: Import
ru: Импортировать

# importingDataMessage
source: Importing data...
ru: Импорт данных...

# failedToImportMessage
source: Failed to import: $error
ru: Не удалось импортировать: $error

# rutrackerLoginTooltip
source: RuTracker Login
ru: Вход в RuTracker

# mirrorsTooltip
source: Mirrors
ru: Зеркала

# currentMirrorLabel
source: Current mirror: {host}
ru: Текущее зеркало: {host}

# allMirrorsFailedMessage
source: All mirrors failed
ru: Все зеркала недоступны

source: Unknown error
ru: Неизвестная ошибка

# mirrorConnectionError
source: Could not connect to RuTracker mirrors. Check your internet connection or try selecting another mirror in settings
ru: Не удалось подключиться к зеркалам RuTracker. Проверьте подключение к интернету или попробуйте выбрать другое зеркало в настройках

# mirrorConnectionFailed
source: Could not connect to RuTracker mirrors
ru: Не удалось подключиться к зеркалам RuTracker

source: Refresh
ru: Обновить

source: Refresh current search
ru: Обновить текущий поиск

source: Clear search cache
ru: Очистить кэш поиска

source: Cache cleared
ru: Кэш очищен

source: All cache cleared
ru: Весь кэш очищен

source: Download via Magnet
ru: Скачать через Magnet

source: Download started
ru: Загрузка начата

source: Refresh chapters from torrent
ru: Обновить главы из торрента

# chaptersRefreshed
source: Chapters refreshed from torrent
ru: Главы обновлены из торрента

source: Failed to refresh chapters
ru: Не удалось обновить главы

# noChaptersFound
source: No chapters found in torrent
ru: Главы в торренте не найдены

source: Failed to start download
ru: Не удалось начать загрузку

source: No active downloads
ru: Нет активных загрузок

# cacheExpires
source: Expires in
ru: Истекает через

# cacheExpired
source: Expired
ru: Истек

# cacheExpiresSoon
source: Expires soon
ru: Скоро истечет

source: days
ru: дн.

source: hours
ru: ч.

source: minutes
ru: мин.

source: Show more
ru: Показать больше

source: Show less
ru: Показать меньше

# selectFolderDialogTitle
source: Select Download Folder
ru: Выбор папки для загрузок

# selectFolderDialogMessage
source: Please select the folder where downloaded audiobooks will be saved. In the file manager, navigate to the desired folder and tap "Use this folder" to confirm.
ru: Пожалуйста, выберите папку, в которую будут сохраняться загруженные аудиокниги. В файловом менеджере перейдите к нужной папке и нажмите "Использовать эту папку" для подтверждения.

# folderSelectedSuccessMessage
source: Download folder selected successfully
ru: Папка для загрузок выбрана успешно

# folderSelectionCancelledMessage
source: Folder selection cancelled
ru: Выбор папки отменен

# currentDownloadFolder
source: Current folder: {path}
ru: Текущая папка: {path}

# defaultDownloadFolder
source: Default folder
ru: Папка по умолчанию

source: Press back again to exit
ru: Нажмите еще раз для выхода

# filterOptionsComingSoon
source: Filter options will be available soon. You will be able to filter by:
ru: Фильтры будут доступны в ближайшее время. Вы сможете фильтровать по:

# filterByCategory
source: Category
ru: Категория

# filterByAuthor
source: Author
ru: Автор

# filterByDate
source: Date Added
ru: Дата добавления

source: Close
ru: Закрыть

source: Open in External Client
ru: Открыть во внешнем клиенте

# downloadTorrentInApp
source: Download using built-in torrent client
ru: Скачать через встроенный клиент

# openedInExternalClient
source: Opened in external torrent client
ru: Открыто во внешнем торрент-клиенте

# failedToOpenExternalClient
source: Failed to open in external client
ru: Не удалось открыть во внешнем клиенте

source: No magnet link available
ru: Magnet-ссылка недоступна

source: Recommended
ru: Рекомендуем

# noResultsForQuery
source: Nothing found for query: "{query}"
ru: Ничего не найдено по запросу: "{query}"

# tryDifferentKeywords
source: Try changing keywords
ru: Попробуйте изменить ключевые слова

source: Clear search
ru: Очистить поиск

# libraryFolderTitle
source: Library Folders
ru: Папки библиотеки

# libraryFolderDescription
source: Select folders where your audiobooks are stored
ru: Выберите папки, где хранятся ваши аудиокниги

# defaultLibraryFolder
source: Default folder
ru: Папка по умолчанию

# addLibraryFolderTitle
source: Add Library Folder
ru: Добавить папку библиотеки

# addLibraryFolderSubtitle
source: Add an additional folder to scan for audiobooks
ru: Добавить дополнительную папку для сканирования аудиокниг

# allLibraryFoldersTitle
source: All Library Folders
ru: Все папки библиотеки

# primaryLibraryFolder
source: Primary folder
ru: Основная папка

# selectLibraryFolderDialogTitle
source: Select Library Folder
ru: Выбрать папку библиотеки

# selectLibraryFolderDialogMessage
source: To select a library folder: 1. Navigate to the desired folder in the file manager 2. Tap "Use this folder" button in the top right corner The selected folder will be used to scan for audiobooks.
ru: Чтобы выбрать папку библиотеки: 1. Перейдите к нужной папке в файловом менеджере 2. Нажмите кнопку "Использовать эту папку" в правом верхнем углу Выбранная папка будет использоваться для сканирования аудиокниг.

# migrateLibraryFolderTitle
source: Migrate Files?
ru: Перенести файлы?

# migrateLibraryFolderMessage
source: Do you want to move your existing audiobooks from the old folder to the new folder?
ru: Хотите переместить существующие аудиокниги из старой папки в новую?

source: Yes
ru: Да

source: No
ru: Нет

# libraryFolderSelectedSuccessMessage
source: Library folder selected successfully
ru: Папка библиотеки успешно выбрана

# libraryFolderAlreadyExistsMessage
source: This folder is already in the library folders list
ru: Эта папка уже есть в списке папок библиотеки

# libraryFolderAddedSuccessMessage
source: Library folder added successfully
ru: Папка библиотеки успешно добавлена

# removeLibraryFolderTitle
source: Remove Folder?
ru: Удалить папку?

# removeLibraryFolderMessage
source: Are you sure you want to remove this folder from the library? This will not delete the files, only stop scanning this folder.
ru: Вы уверены, что хотите удалить эту папку из библиотеки? Это не удалит файлы, только прекратит сканирование этой папки.

source: Remove
ru: Удалить

# libraryFolderRemovedSuccessMessage
source: Library folder removed successfully
ru: Папка библиотеки успешно удалена

# libraryFolderRemoveFailedMessage
source: Failed to remove library folder
ru: Не удалось удалить папку библиотеки

# migratingLibraryFolderMessage
source: Migrating files...
ru: Перенос файлов...

# migrationCompletedSuccessMessage
source: Migration completed successfully
ru: Перенос успешно завершен

# migrationFailedMessage
source: Migration failed
ru: Перенос не удался

# deleteConfirmationTitle
source: Delete Audiobook?
ru: Удалить аудиокнигу?

# deleteConfirmationMessage
source: Are you sure you want to delete this audiobook?
ru: Вы уверены, что хотите удалить эту аудиокнигу?

# deleteWarningMessage
source: Files will be permanently deleted and cannot be recovered.
ru: Файлы будут безвозвратно удалены и не могут быть восстановлены.

# deleteFilesButton
source: Delete Files
ru: Удалить файлы

# removeFromLibraryButton
source: Remove from Library
ru: Удалить из библиотеки

# removeFromLibraryTitle
source: Remove from Library?
ru: Удалить из библиотеки?

# removeFromLibraryMessage
source: This will remove the audiobook from your library but will not delete the files. You can add it back by rescanning.
ru: Это удалит аудиокнигу из вашей библиотеки, но не удалит файлы. Вы можете добавить её обратно, выполнив повторное сканирование.

# removingFromLibraryMessage
source: Removing...
ru: Удаление...

# removedFromLibrarySuccessMessage
source: Removed from library successfully
ru: Успешно удалено из библиотеки

# removeFromLibraryFailedMessage
source: Failed to remove from library
ru: Не удалось удалить из библиотеки

# deletingMessage
source: Deleting...
ru: Удаление...

# deletedSuccessMessage
source: Files deleted successfully
ru: Файлы успешно удалены

# deleteFailedMessage
source: Failed to delete files
ru: Не удалось удалить файлы

# fileInUseMessage
source: Cannot delete: File is currently being played
ru: Нельзя удалить: файл сейчас воспроизводится

# showInfoButton
source: Show Info
ru: Показать информацию

source: Path
ru: Путь

# fileCount
source: Files
ru: Файлы

source: Total Size
ru: Общий размер

# audiobookGroupName
source: Group
ru: Группа

# storageManagementTitle
source: Storage Management
ru: Управление хранилищем

# deleteSelectedButton
source: Delete Selected
ru: Удалить выбранные

# storageSummaryTitle
source: Storage Summary
ru: Сводка хранилища

source: Total Library Size
ru: Общий размер библиотеки

# audiobookGroupsCount
source: Audiobook Groups
ru: Группы аудиокниг

source: Cache Size
ru: Размер кэша

# libraryFoldersTitle
source: Library Folders
ru: Папки библиотеки

# cacheSectionTitle
source: Cache
ru: Кэш

# totalCacheSize
source: Total Cache
ru: Общий кэш

# clearPlaybackCacheButton
source: Clear Playback Cache
ru: Очистить кэш воспроизведения

# audiobookGroupsTitle
source: Audiobook Groups
ru: Группы аудиокниг

# deselectAllButton
source: Deselect All
ru: Снять выделение

# selectAllButton
source: Select All
ru: Выбрать все

# noAudiobooksMessage
source: No audiobooks found
ru: Аудиокниги не найдены

# deleteSelectedTitle
source: Delete Selected?
ru: Удалить выбранные?

# deleteSelectedMessage
source: Are you sure you want to delete {count} selected audiobook(s)?
ru: Вы уверены, что хотите удалить {count} выбранную(ых) аудиокнигу(и)?

# deleteSelectedResultMessage
source: Deleted: {success}, Failed: {failed}
ru: Удалено: {success}, Не удалось: {failed}

# clearPlaybackCacheTitle
source: Clear Playback Cache?
ru: Очистить кэш воспроизведения?

# clearPlaybackCacheMessage
source: This will clear the playback cache. Playback may be slower until cache is rebuilt.
ru: Это очистит кэш воспроизведения. Воспроизведение может быть медленнее, пока кэш не будет восстановлен.

# clearingCacheMessage
source: Clearing cache...
ru: Очистка кэша...

# cacheClearedSuccessMessage
source: Cache cleared successfully
ru: Кэш успешно очищен

# clearAllCacheTitle
source: Clear All Cache?
ru: Очистить весь кэш?

# clearAllCacheMessage
source: This will clear all cache including playback cache, temporary files, and old logs.
ru: Это очистит весь кэш, включая кэш воспроизведения, временные файлы и старые логи.

# storageManagementDescription
source: Manage library size, cache, and files
ru: Управление размером библиотеки, кэшем и файлами

# openStorageManagementButton
source: Open Storage Management
ru: Открыть управление хранилищем

# partialDeletionSuccessMessage
source: Partially deleted: {deleted}/{total} files
ru: Частично удалено: {deleted}/{total} файлов

# showDetailsButton
source: Details
ru: Детали

# permissionDeniedDeletionMessage
source: Permission denied: Cannot delete file
ru: Доступ запрещен: Нельзя удалить файл

# deletionDetailsTitle
source: Deletion Details
ru: Детали удаления
