Repository: Gosayram/jabook
Catalog: lib/l10n/app_*.arb
Languages: ru

# deletionSummaryMessage
source: Deleted: {deleted}/{total} files
ru: Удалено: {deleted}/{total} файлов

# errorsTitle
source: Errors:
ru: Ошибки:

# retryButton
source: Retry
ru: Повторить

# backgroundWorkTitle
source: Background Work
ru: Фоновая работа

source: Refresh diagnostics
ru: Обновить диагностику

source: Device Information
ru: Информация об устройстве

source: Manufacturer
ru: Производитель

source: Custom ROM
ru: Оболочка

source: Android Version
ru: Версия Android

source: Background Activity Mode
ru: Режим фоновой активности

source: Compatibility: OK
ru: Совместимость: ОК

source: Issues Detected
ru: Обнаружены проблемы

source: Detected Issues:
ru: Обнаруженные проблемы:

source: Recommendations
ru: Рекомендации

source: Manufacturer Settings
ru: Настройки производителя

# manufacturerSettingsDescription
source: To ensure stable background operation, you need to configure manufacturer-specific device settings.
ru: Для стабильной работы приложения в фоне необходимо настроить параметры производителя устройства.

# autostartApp
source: Autostart Application
ru: Автозапуск приложения

# enableAutostart
source: Enable autostart for stable operation
ru: Включите автозапуск для стабильной работы

source: Battery Optimization
ru: Оптимизация батареи

# disableBatteryOptimization
source: Disable battery optimization for the application
ru: Отключите оптимизацию батареи для приложения

source: Background Activity
ru: Фоновая активность

source: Allow background activity
ru: Разрешите фоновую активность

source: Show Instructions
ru: Показать инструкции

source: WorkManager Diagnostics
ru: Диагностика WorkManager

source: Last Executions:
ru: Последние выполнения:

# executionHistoryEmpty
source: Execution history is empty
ru: История выполнения задач пока пуста

source: Total
ru: Всего

source: Successful
ru: Успешно

source: Errors
ru: Ошибок

source: Avg. Delay
ru: Ср. задержка

# minutesAbbr
source: min
ru: мин

# delay
source: Delay: {minutes} min
ru: Задержка: {minutes} мин

# errorLabel
source: Error: {reason}
ru: Ошибка: {reason}

# appStandbyBucketRestricted
source: Application is in restricted background activity mode (Standby Bucket: {bucket})
ru: Приложение находится в режиме ограниченной фоновой активности (Standby Bucket: {bucket})

# useAppMoreFrequently
source: Use the application more frequently so the system moves it to active mode
ru: Используйте приложение чаще, чтобы система перевела его в активный режим

# aggressiveBatteryOptimization
source: Device from manufacturer with aggressive battery optimization detected ({manufacturer}, {rom})
ru: Обнаружено устройство от производителя с агрессивной оптимизацией батареи ({manufacturer}, {rom})

# configureAutostartAndBattery
source: It is recommended to configure autostart and disable battery optimization for the application
ru: Рекомендуется настроить автозапуск и отключить оптимизацию батареи для приложения

# openManufacturerSettings
source: Open manufacturer settings through the application menu
ru: Откройте настройки производителя через меню приложения

# android14ForegroundServices
source: On Android 14+, make sure Foreground Services start correctly
ru: На Android 14+ убедитесь, что Foreground Services запускаются корректно

# compatibilityIssuesDetected
source: Background work issues detected
ru: Обнаружены проблемы с фоновой работой приложения

# workManagerTaskDelayed
source: WorkManager task "{taskName}" delayed by {hours} hours (expected: {minutes} minutes)
ru: Задача WorkManager "{taskName}" задержана на {hours} часов (ожидалось: {minutes} минут)

# foregroundServiceKilled
source: Foreground Service "{serviceName}" was unexpectedly terminated by the system
ru: Foreground Service "{serviceName}" был неожиданно завершён системой

# standbyBucketActive
source: Actively Used
ru: Активно

# standbyBucketWorkingSet
source: Frequently Used
ru: Часто используется

# standbyBucketFrequent
source: Regularly Used
ru: Регулярно

# standbyBucketRare
source: Rarely Used
ru: Редко

# standbyBucketNever
source: Never Used (Restricted)
ru: Никогда (ограничено)

# standbyBucketUnknown
source: Unknown ({bucket})
ru: Неизвестно ({bucket})

# standbyBucketActiveUsed
source: Actively Used
ru: Активно используется

# standbyBucketFrequentlyUsed
source: Frequently Used
ru: Часто используется

# standbyBucketRegularlyUsed
source: Regularly Used
ru: Регулярно используется

# standbyBucketRarelyUsed
source: Rarely Used
ru: Редко используется

# standbyBucketNeverUsed
source: Never Used (Restricted)
ru: Никогда не используется (ограничено)

# manufacturerSettingsTitle
source: Settings for Stable Operation
ru: Настройки для стабильной работы

# manufacturerSettingsDialogDescription
source: To ensure stable operation, you need to configure the following settings:
ru: Для стабильной работы приложения необходимо настроить следующие параметры:

# enableAutostartStep
source: 1. Enable application autostart
ru: 1. Включите автозапуск приложения

# disableBatteryOptimizationStep
source: 2. Disable battery optimization for the application
ru: 2. Отключите оптимизацию батареи для приложения

# allowBackgroundActivityStep
source: 3. Allow background activity
ru: 3. Разрешите фоновую активность

# detectedRom
source: Detected ROM: {rom}
ru: Обнаружена оболочка: {rom}

source: Skip
ru: Пропустить

source: Got It
ru: Понятно

# backgroundCompatibilityBannerTitle
source: Background Operation Settings
ru: Настройки фоновой работы

# backgroundCompatibilityBannerMessage
source: To ensure stable background operation, you may need to configure device settings.
ru: Для стабильной работы приложения в фоне может потребоваться настройка параметров устройства.

source: Dismiss
ru: Закрыть

# loginSuccessfulMessage
source: Login successful!
ru: Авторизация успешна!

# openSettingsButton
source: Open Settings
ru: Открыть настройки

# compatibilityDiagnosticsTitle
source: Compatibility & Diagnostics
ru: Совместимость и диагностика

# compatibilityDiagnosticsSubtitle
source: Compatibility check and manufacturer settings configuration
ru: Проверка совместимости и настройка параметров производителя

# selectFolderButton
source: Select Folder
ru: Выбрать папку

# continueButton
source: Continue
ru: Продолжить

# errorAddingFolder
source: Error adding folder: $error
ru: Ошибка добавления папки: $error

source: No audiobook group provided
ru: Группа аудиокниг не предоставлена

# sleepTimerPaused
source: Sleep timer: Playback paused
ru: Таймер сна: Воспроизведение приостановлено

# failedToChangeSpeed
source: Failed to change speed: $error
ru: Не удалось изменить скорость: $error

# cancelTimerButton
source: Cancel timer
ru: Отменить таймер

# endOfChapterLabel
source: End of chapter
ru: Конец главы

# atEndOfChapterLabel
source: At end of chapter
ru: В конце главы

# itemsInTrashLabel
source: Items in Trash
ru: Элементы в корзине

# trashSizeLabel
source: Trash Size
ru: Размер корзины

# manageTrashButton
source: Manage Trash
ru: Управление корзиной

# fileLabel
source: file
ru: файл

# filesLabel
source: files
ru: файлов

# failedToLoadTrash
source: Failed to load trash: $error
ru: Не удалось загрузить корзину: $error

source: Item restored successfully
ru: Элемент успешно восстановлен

source: Failed to restore item
ru: Не удалось восстановить элемент

# errorRestoringItem
source: Error restoring item: $error
ru: Ошибка восстановления элемента: $error

# permanentlyDeleteTitle
source: Permanently Delete
ru: Удалить навсегда

# permanentlyDeleteMessage
source: Are you sure you want to permanently delete "{name}"? This action cannot be undone.
ru: Вы уверены, что хотите безвозвратно удалить "{name}"? Это действие нельзя отменить.

source: Item permanently deleted
ru: Элемент безвозвратно удален

source: Failed to delete item
ru: Не удалось удалить элемент

# errorDeletingItem
source: Error deleting item: $error
ru: Ошибка удаления элемента: $error

# clearAllTrashTitle
source: Clear All Trash
ru: Очистить всю корзину

# clearAllTrashMessage
source: Are you sure you want to permanently delete all items in trash? This action cannot be undone.
ru: Вы уверены, что хотите безвозвратно удалить все элементы в корзине? Это действие нельзя отменить.

# filePickerAlreadyOpen
source: File picker is already open. Please close it first.
ru: Файловый менеджер уже открыт. Пожалуйста, закройте его сначала.

# applyButton
source: Apply
ru: Применить

# lastMessageSort
source: Last message
ru: Посл. сообщение

# topicNameSort
source: Topic name
ru: Название темы

# postingTimeSort
source: Posting time
ru: Время размещения

# operationTimedOut
source: Operation timed out. Please try again.
ru: Операция превысила время ожидания. Пожалуйста, попробуйте снова.

# permissionDeniedDownloads
source: Permission denied. Please check app permissions in settings.
ru: Доступ запрещен. Пожалуйста, проверьте разрешения приложения в настройках.

# downloadNotFound
source: Download not found. It may have been removed.
ru: Загрузка не найдена. Возможно, она была удалена.

# anErrorOccurred
source: An error occurred. Please try again.
ru: Произошла ошибка. Пожалуйста, попробуйте снова.

# initializationError
source: Initialization error: $error
ru: Ошибка инициализации: $error

# criticalError
source: Critical error: $error
ru: Критическая ошибка: $error

# capabilityCheckError
source: Error checking capabilities: $error
ru: Ошибка проверки возможностей: $error

# filesSelected
source: Files selected: $count
ru: Выбрано файлов: $count

# fileSelectionError
source: Error selecting files: $error
ru: Ошибка выбора файлов: $error

# imagesSelected
source: Images selected: $count
ru: Выбрано изображений: $count

# imageSelectionError
source: Error selecting images: $error
ru: Ошибка выбора изображений: $error

# testNotificationTitle
source: Test notification
ru: Тест уведомления

# testNotificationBody
source: This is a test notification from JaBook
ru: Это тестовое уведомление от JaBook

source: Notification sent
ru: Уведомление отправлено

# failedToSendNotification
source: Failed to send notification (channel not implemented)
ru: Не удалось отправить уведомление (канал не реализован)

# bluetoothAvailable
source: Bluetooth available: $available
ru: Bluetooth доступен: $available

source: Paired devices: $count
ru: Сопряженных устройств: $count

# bluetoothCheckError
source: Error checking Bluetooth: $error
ru: Ошибка проверки Bluetooth: $error

# systemCapabilitiesTitle
source: System Capabilities
ru: Системные возможности

# fileAccessCapability
source: File Access
ru: Доступ к файлам

# imageAccessCapability
source: Image Access
ru: Доступ к изображениям

# cameraCapability
source: Camera
ru: Камера

# photoTaken
source: Photo taken: $path
ru: Фото сделано: $path

source: Photo not taken
ru: Фото не сделано

# cameraError
source: Camera error: $error
ru: Ошибка камеры: $error

# notificationsCapability
source: Notifications
ru: Уведомления

# capabilityExplanationButton
source: Explain Capabilities
ru: Объяснение возможностей

# testButton
source: Test
ru: Тест

# permissionsForJaBookTitle
source: Permissions for JaBook
ru: Разрешения для JaBook

# fileAccessPermissionTitle
source: File Access
ru: Доступ к файлам

# fileAccessPermissionDescription
source: Needed to save and play audiobooks. On Android 11+, you'll need to enable "All files access" in system settings.
ru: Нужен для сохранения и воспроизведения аудиокниг. На Android 11+ потребуется включить "Доступ ко всем файлам" в настройках системы.

# notificationsPermissionTitle
source: Notifications
ru: Уведомления

# batteryOptimizationPermissionTitle
source: Battery Optimization
ru: Оптимизация батареи

# batteryOptimizationPermissionDescription
source: So the app can work in background for playback.
ru: Чтобы приложение работало в фоне для воспроизведения.

# permissionsHelpMessage
source: These permissions will help provide a better app experience.
ru: Эти разрешения помогут обеспечить лучший опыт использования приложения.

# webViewLoginButton
source: Login to RuTracker via WebView
ru: Войти в RuTracker через WebView

# webViewLoginSubtitle
source: Pass Cloudflare/captcha and save cookies for client
ru: Пройти Cloudflare/капчу и сохранить cookie для клиента

# cookieSavedMessage
source: Cookies saved for HTTP client
ru: Cookie сохранены для HTTP-клиента

# failedToParseSearchResultsEncoding
source: Failed to parse search results due to encoding issue. This may be a temporary server problem. Please try again. If the problem persists, try changing the mirror in Settings → Sources.
ru: Не удалось распарсить результаты поиска из-за проблемы с кодировкой. Это может быть временная проблема сервера. Пожалуйста, попробуйте снова. Если проблема сохраняется, попробуйте изменить зеркало в Настройках → Источники.

# failedToParseSearchResultsStructure
source: Failed to parse search results. The page structure may have changed. Please try again. If the problem persists, try changing the mirror in Settings → Sources.
ru: Не удалось распарсить результаты поиска. Структура страницы могла измениться. Пожалуйста, попробуйте снова. Если проблема сохраняется, попробуйте изменить зеркало в Настройках → Источники.

# searchFailedMessage
source: Search failed: {errorType}
ru: Поиск не удался: {errorType}

# topicTitleSort
source: Topic title
ru: Название темы

# postTimeSort
source: Post time
ru: Время размещения

# localStreamServerStarted
source: Local stream server started on http://{host}:{port}
ru: Локальный сервер потоковой передачи запущен на http://{host}:{port}

# failedToStartStreamServer
source: Failed to start stream server: {error}
ru: Не удалось запустить сервер потоковой передачи: {error}

source: Local stream server stopped
ru: Локальный сервер потоковой передачи остановлен

# failedToStopStreamServer
source: Failed to stop stream server: {error}
ru: Не удалось остановить сервер потоковой передачи: {error}

source: Missing book ID parameter
ru: Отсутствует параметр ID книги

source: Invalid file index parameter
ru: Неверный параметр индекса файла

source: File not found
ru: Файл не найден

source: Streaming error
ru: Ошибка потоковой передачи

source: Invalid range header
ru: Неверный заголовок диапазона

source: Requested range not satisfiable
ru: Запрошенный диапазон не может быть выполнен

source: Range request error
ru: Ошибка запроса диапазона

source: Static file error
ru: Ошибка статического файла

# failedToStartAudioService
source: Failed to start audio service: {error}
ru: Не удалось запустить аудио сервис: {error}

# failedToPlayMedia
source: Failed to play media: {error}
ru: Не удалось воспроизвести медиа: {error}

# failedToPauseMedia
source: Failed to pause media: {error}
ru: Не удалось приостановить медиа: {error}

# failedToStopMedia
source: Failed to stop media: {error}
ru: Не удалось остановить медиа: {error}

# failedToSeek
source: Failed to seek: {error}
ru: Не удалось перейти к позиции: {error}

# failedToSetSpeed
source: Failed to set speed: {error}
ru: Не удалось установить скорость: {error}

source: Failed to initialize logger
ru: Не удалось инициализировать логгер

source: Failed to write log
ru: Не удалось записать лог

source: Log rotation failed
ru: Не удалось выполнить ротацию логов

source: Failed to rotate logs
ru: Не удалось выполнить ротацию логов

source: Failed to clean old logs
ru: Не удалось очистить старые логи

# errorSharingLogs
source: Error sharing logs: {error}
ru: Ошибка при отправке логов: {error}

source: Failed to share logs
ru: Не удалось отправить логи

source: Failed to read logs
ru: Не удалось прочитать логи

source: CacheManager not initialized
ru: CacheManager не инициализирован

# failedToParseSearchResults
source: Failed to parse search results: {error}
ru: Не удалось распарсить результаты поиска: {error}

# failedToParseTopicDetails
source: Failed to parse topic details: {error}
ru: Не удалось распарсить детали темы: {error}

source: Failed to parse categories
ru: Не удалось распарсить категории

source: Failed to parse category topics
ru: Не удалось распарсить темы категории

# radioPlayCategory
source: Radio Play
ru: Радиоспектакль

# audiobookCategory
source: Audiobook
ru: Аудиокнига

# biographyCategory
source: Biography
ru: Биография

# memoirsCategory
source: Memoirs
ru: Мемуары

# historyCategory
source: History
ru: История

# addedLabel
source: Added
ru: Добавлено

# invalidMagnetUrlMissingHash
source: Invalid magnet URL: missing info hash
ru: Неверный magnet URL: отсутствует info hash

source: Invalid info hash length
ru: Неверная длина info hash

# failedToStartDownloadWithError
source: Failed to start download: {error}
ru: Не удалось начать загрузку: {error}

# downloadNotFoundTorrent
source: Download not found
ru: Загрузка не найдена

# failedToPauseDownload
source: Failed to pause download: {error}
ru: Не удалось приостановить загрузку: {error}

# failedToResumeDownload
source: Failed to resume download: {error}
ru: Не удалось возобновить загрузку: {error}

# failedToRemoveDownload
source: Failed to remove download: {error}
ru: Не удалось удалить загрузку: {error}

# failedToGetActiveDownloads
source: Failed to get active downloads: {error}
ru: Не удалось получить активные загрузки: {error}

# failedToShutdownTorrentManager
source: Failed to shutdown torrent manager: {error}
ru: Не удалось остановить менеджер торрентов: {error}

source: No healthy endpoints available
ru: Нет доступных здоровых конечных точек

# authRepositoryProviderMustBeOverridden
source: AuthRepositoryProvider must be overridden with proper context
ru: AuthRepositoryProvider должен быть переопределен с правильным контекстом

# useEndpointManagerGetActiveEndpoint
source: Use EndpointManager.getActiveEndpoint() for dynamic mirror selection
ru: Используйте EndpointManager.getActiveEndpoint() для динамического выбора зеркала

# cacheManagerNotInitializedConfig
source: CacheManager not initialized
ru: CacheManager не инициализирован

# searchFailedWithMessage
source: Search failed: {message}
ru: Поиск не удался: {message}

source: Failed to search audiobooks
ru: Не удалось выполнить поиск аудиокниг

# failedToFetchCategories
source: Failed to fetch categories: {message}
ru: Не удалось получить категории: {message}

source: Failed to get categories
ru: Не удалось получить категории

# failedToGetCategoryAudiobooksWithMessage
source: Failed to get category audiobooks: {message}
ru: Не удалось получить аудиокниги категории: {message}

source: Failed to get category audiobooks
ru: Не удалось получить аудиокниги категории

# failedToFetchAudiobookDetails
source: Failed to fetch audiobook details: {message}
ru: Не удалось получить детали аудиокниги: {message}

source: Failed to get audiobook details
ru: Не удалось получить детали аудиокниги

# failedToFetchNewReleases
source: Failed to fetch new releases: {message}
ru: Не удалось получить новые релизы: {message}

# failedToSaveCredentials
source: Failed to save credentials: {error}
ru: Не удалось сохранить учетные данные: {error}

# failedToRetrieveCredentials
source: Failed to retrieve credentials: {error}
ru: Не удалось получить учетные данные: {error}

# failedToClearCredentials
source: Failed to clear credentials: {error}
ru: Не удалось очистить учетные данные: {error}

source: No credentials to export
ru: Нет учетных данных для экспорта

# unsupportedExportFormat
source: Unsupported export format: {format}
ru: Неподдерживаемый формат экспорта: {format}

source: Invalid CSV format
ru: Неверный формат CSV

source: Invalid CSV data
ru: Неверные данные CSV

source: Invalid JSON format
ru: Неверный формат JSON

# unsupportedImportFormat
source: Unsupported import format: {format}
ru: Неподдерживаемый формат импорта: {format}

# failedToImportCredentials
source: Failed to import credentials: {error}
ru: Не удалось импортировать учетные данные: {error}

# errorWithDetails
source: Error: {error}
ru: Ошибка: {error}

# fileSingular
source: file
ru: файл

# filePlural
source: files
ru: файлов

# deleteSelectedAudiobooksConfirmation
source: Are you sure you want to delete {count} selected audiobook(s)?
ru: Вы уверены, что хотите удалить {count} выбранную(ых) аудиокнигу(и)?

# clearPlaybackCacheDescription
source: This will clear the playback cache. Playback may be slower until cache is rebuilt.
ru: Это очистит кэш воспроизведения. Воспроизведение может быть медленнее, пока кэш не будет восстановлен.

# clearAllCacheDescription
source: This will clear all cache including playback cache, temporary files, and old logs.
ru: Это очистит весь кэш, включая кэш воспроизведения, временные файлы и старые логи.

# sessionExpiredTitle
source: Session Expired
ru: Сессия истекла

# sessionExpiredMessage
source: Your session has expired. Please sign in again.
ru: Ваша сессия истекла. Пожалуйста, войдите в систему снова.

# invalidCredentialsTitle
source: Authorization Error
ru: Ошибка авторизации

# invalidCredentialsMessage
source: Invalid username or password. Please check your credentials.
ru: Неверный логин или пароль. Проверьте введенные данные.

# loginRequiredTitle
source: Authentication Required
ru: Требуется авторизация

# loginRequiredMessage
source: You need to log in to perform this action.
ru: Для выполнения этого действия необходимо войти в систему.

# authorizationErrorTitle
source: Authorization Error
ru: Ошибка авторизации

# accessDeniedMessage
source: Access denied. Please check your credentials or log in again.
ru: Доступ запрещен. Проверьте правильность учетных данных или войдите снова.

# networkErrorTitle
source: Network Error
ru: Ошибка сети

# networkRequestFailedMessage
source: Failed to complete the request. Please check your internet connection.
ru: Не удалось выполнить запрос. Проверьте подключение к интернету.

# errorOccurredMessage
source: An error occurred while performing the operation.
ru: Произошла ошибка при выполнении операции.

# sessionExpiredSnackBar
source: Session expired. Please log in again.
ru: Сессия истекла. Пожалуйста, войдите снова.

# invalidCredentialsSnackBar
source: Invalid username or password.
ru: Неверный логин или пароль.

# authorizationErrorSnackBar
source: Authorization error. Please check your credentials.
ru: Ошибка авторизации. Проверьте учетные данные.

# networkErrorSnackBar
source: Network error. Please check your connection.
ru: Ошибка сети. Проверьте подключение.

# captchaVerificationRequired
source: Captcha verification required. Please try again later.
ru: Требуется проверка капчи. Пожалуйста, попробуйте позже.

# networkErrorCheckConnection
source: Network error. Please check your connection and try again.
ru: Ошибка сети. Пожалуйста, проверьте подключение и попробуйте снова.

# authenticationFailedMessage
source: Authentication failed. Please check your credentials and try again.
ru: Ошибка аутентификации. Пожалуйста, проверьте учетные данные и попробуйте снова.

# loginFailedWithError
source: Login failed: {error}
ru: Вход не удался: {error}

# noAccessibleAudioFiles
source: No accessible audio files found
ru: Не найдено доступных аудиофайлов

# aboutTitle
source: About
ru: О приложении

# aboutAppSlogan
source: Modern audiobook player for torrents
ru: Современный аудиоплеер для торрентов

source: App Version
ru: Версия приложения

# buildNumber
source: Build
ru: Сборка

source: Package ID
ru: ID пакета

# licenseTitle
source: License
ru: Лицензия

# licenseDescription
source: JaBook is distributed under the Apache 2.0 license. Tap to view the full license text and list of third-party libraries.
ru: Приложение JaBook распространяется по лицензии Apache 2.0. Нажмите, чтобы посмотреть полный текст лицензии и список сторонних библиотек.

source: Main License
ru: Основная лицензия

# thirdPartyLicenses
source: Third-Party Libraries
ru: Сторонние библиотеки

source: Telegram Channel
ru: Telegram канал

# openTelegramChannel
source: Open channel in Telegram
ru: Открыть канал в Telegram
