Repository: Gosayram/jabook
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Contact Developer
ru: Написать разработчику

source: Open email client
ru: Открыть почтовый клиент

source: Support Project
ru: Поддержать проект

# supportProjectDescription
source: Donate or support development
ru: Пожертвовать или поддержать разработку

# githubRepositoryDescription
source: Source code and changelog
ru: Исходный код и список изменений

source: Changelog
ru: Список изменений

# changelogDescription
source: Version history and updates
ru: История версий и обновлений

# issuesDescription
source: Report bugs and request features
ru: Сообщить об ошибках и запросить функции

source: About Developer
ru: О разработчике

# aboutDeveloperText
source: JaBook is developed by Jabook Contributors team. This is an open source project created for convenient listening to audiobooks from open sources and torrents. No ads, no registration — just pure listening.
ru: JaBook разработан командой Jabook Contributors. Это open source проект, созданный для удобного прослушивания аудиокниг из открытых источников и торрентов. Без рекламы, без регистрации — простое прослушивание.

# copyInfo
source: Copy
ru: Скопировать

source: Info copied
ru: Информация скопирована

source: Failed to open link
ru: Не удалось открыть ссылку

# failedToOpenEmail
source: Failed to open email client
ru: Не удалось открыть почтовый клиент

source: View in app
ru: Просмотр в приложении

source: View licenses
ru: Просмотр лицензий

source: License on GitHub
ru: Лицензия на GitHub

source: View LICENSE file
ru: Просмотр файла LICENSE

# appDiscussionQuestionsReviews
source: App discussion, questions and reviews
ru: Обсуждение приложения, вопросы и отзывы

# versionInformationLongPress
source: Version information. Long press to copy.
ru: Информация о версии. Долгое нажатие для копирования.

source: Unknown
ru: Неизвестно

# emailFeedbackSubject
source: JaBook - Feedback
ru: JaBook – обратная связь

# emailFeedbackApp
source: App: JaBook
ru: Приложение: JaBook

# emailFeedbackVersion
source: Version:
ru: Версия:

# emailFeedbackDevice
source: Device:
ru: Устройство:

# emailFeedbackDescription
source: Description of issue / suggestion:
ru: Описание проблемы / предложения:

# aboutSectionDescription
source: App information and links
ru: Информация о приложении и ссылки

# aboutSectionSubtitle
source: Version, license, and developer information
ru: Версия, лицензия и информация о разработчике

# rewindDurationTitle
source: Rewind Duration
ru: Длительность перемотки назад

# forwardDurationTitle
source: Forward Duration
ru: Длительность перемотки вперед

# inactivityTimeoutTitle
source: Inactivity Timeout
ru: Таймаут неактивности

# inactivityTimeoutLabel
source: Set inactivity timeout
ru: Установить таймаут неактивности

source: minute
ru: минута

source: Rewind
ru: Назад

source: Forward
ru: Вперед

# currentPosition
source: Current
ru: Текущая

# newPosition
source: New
ru: Новая

# secondsLabel
source: seconds
ru: секунд

# languageSettingsLabel
source: Language settings
ru: Настройки языка

# mirrorSourceSettingsLabel
source: Mirror and source settings
ru: Настройки зеркал и источников

# rutrackerSessionLabel
source: RuTracker session management
ru: Управление сессией RuTracker

# metadataManagementLabel
source: Metadata management
ru: Управление метаданными

# themeSettingsLabel
source: Theme settings
ru: Настройки темы

# audioPlaybackSettingsLabel
source: Audio playback settings
ru: Настройки воспроизведения аудио

# downloadSettingsLabel
source: Download settings
ru: Настройки загрузки

# libraryFolderSettingsLabel
source: Library folder settings
ru: Настройки папки библиотеки

# storageManagementLabel
source: Storage management
ru: Управление хранилищем

# cacheSettingsLabel
source: Cache settings
ru: Настройки кэша

# appPermissionsLabel
source: App permissions
ru: Разрешения приложения

# aboutAppLabel
source: About app
ru: О приложении

# backgroundTaskCompatibilityLabel
source: Background task compatibility
ru: Совместимость фоновых задач

# backupRestoreLabel
source: Backup and restore
ru: Резервное копирование и восстановление

# selectFavorites
source: Select
ru: Выбрать

# clearSelectedFavorites
source: Delete Selected
ru: Удалить выбранные

# clearAllFavorites
source: Clear All
ru: Очистить все

# clearAllFavoritesTitle
source: Clear All Favorites?
ru: Очистить все закладки?

# clearAllFavoritesMessage
source: This will remove all favorite audiobooks. This action cannot be undone.
ru: Это удалит все избранные аудиокниги. Это действие нельзя отменить.

source: Favorites cleared
ru: Закладки очищены

# favoritesDeleted
source: {count} favorite(s) deleted
ru: Удалено закладок: {count}

source: No favorites selected
ru: Закладки не выбраны

source: selected
ru: выбрано

# sortByLabel
source: Sort by:
ru: Сортировать по:

# groupByLabel
source: Group by:
ru: Группировать по:

# sortByNameAsc
source: Name (A-Z)
ru: Имя (А-Я)

# sortByNameDesc
source: Name (Z-A)
ru: Имя (Я-А)

# sortBySizeAsc
source: Size (Smallest)
ru: Размер (Меньший)

# sortBySizeDesc
source: Size (Largest)
ru: Размер (Больший)

# sortByDateAsc
source: Date (Oldest)
ru: Дата (Старые)

# sortByDateDesc
source: Date (Newest)
ru: Дата (Новые)

# sortByFilesAsc
source: Files (Fewest)
ru: Файлы (Меньше)

# sortByFilesDesc
source: Files (Most)
ru: Файлы (Больше)

# groupByNone
source: None
ru: Нет

# groupByFirstLetter
source: First Letter
ru: Первая буква

source: Scanning library...
ru: Сканирование библиотеки...

# manufacturerSettingsNotAvailable
source: Settings Not Available
ru: Настройки недоступны

# manufacturerSettingsNotAvailableMessage
source: Manufacturer-specific settings are only available on Android devices.
ru: Настройки производителя доступны только на устройствах Android.

# manufacturerSettingsDefaultTitle
source: Settings for Stable Operation
ru: Настройки для стабильной работы

# manufacturerSettingsDefaultMessage
source: To ensure stable operation, you need to configure the following settings:
ru: Для стабильной работы приложения необходимо настроить следующие параметры:

# manufacturerSettingsDefaultStep1
source: 1. Enable application autostart
ru: 1. Включите автозапуск приложения

# manufacturerSettingsDefaultStep2
source: 2. Disable battery optimization for the application
ru: 2. Отключите оптимизацию батареи для приложения

# manufacturerSettingsDefaultStep3
source: 3. Allow background activity
ru: 3. Разрешите фоновую активность

# manufacturerSettingsMiuiTitle
source: MIUI Settings for Stable Operation
ru: Настройки MIUI для стабильной работы

# manufacturerSettingsMiuiMessage
source: On Xiaomi/Redmi/Poco devices, you need to configure the following settings:
ru: На устройствах Xiaomi/Redmi/Poco необходимо настроить следующие параметры:

# manufacturerSettingsMiuiStep1
source: 1. Autostart: Settings → Apps → Permission management → Autostart → Enable for {appName}
ru: 1. Автозапуск: Настройки → Приложения → Управление разрешениями → Автозапуск → Включите для {appName}

# manufacturerSettingsMiuiStep2
source: 2. Battery optimization: Settings → Battery → Battery optimization → Select {appName} → Don't optimize
ru: 2. Оптимизация батареи: Настройки → Батарея → Оптимизация батареи → Выберите {appName} → Не оптимизировать

# manufacturerSettingsMiuiStep3
source: 3. Background activity: Settings → Apps → {appName} → Battery → Background activity → Allow
ru: 3. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Фоновая активность → Разрешить

# manufacturerSettingsEmuiTitle
source: EMUI Settings for Stable Operation
ru: Настройки EMUI для стабильной работы

# manufacturerSettingsEmuiMessage
source: On Huawei/Honor devices, you need to configure the following settings:
ru: На устройствах Huawei/Honor необходимо настроить следующие параметры:

# manufacturerSettingsEmuiStep1
source: 1. App protection: Settings → Apps → App protection → {appName} → Enable autostart
ru: 1. Защита приложений: Настройки → Приложения → Защита приложений → {appName} → Включите автозапуск

# manufacturerSettingsEmuiStep2
source: 2. Battery management: Settings → Battery → Battery management → {appName} → Don't optimize
ru: 2. Управление батареей: Настройки → Батарея → Управление батареей → {appName} → Не оптимизировать

# manufacturerSettingsEmuiStep3
source: 3. Background activity: Settings → Apps → {appName} → Battery → Allow background activity
ru: 3. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Разрешить фоновую активность

# manufacturerSettingsColorosTitle
source: ColorOS/RealmeUI Settings for Stable Operation
ru: Настройки ColorOS/RealmeUI для стабильной работы

# manufacturerSettingsColorosMessage
source: On Oppo/Realme devices, you need to configure the following settings:
ru: На устройствах Oppo/Realme необходимо настроить следующие параметры:

# manufacturerSettingsColorosStep1
source: 1. Autostart: Settings → Apps → Autostart → Enable for {appName}
ru: 1. Автозапуск: Настройки → Приложения → Автозапуск → Включите для {appName}

# manufacturerSettingsColorosStep2
source: 2. Battery optimization: Settings → Battery → Battery optimization → {appName} → Don't optimize
ru: 2. Оптимизация батареи: Настройки → Батарея → Оптимизация батареи → {appName} → Не оптимизировать

# manufacturerSettingsColorosStep3
source: 3. Background activity: Settings → Apps → {appName} → Battery → Allow background activity
ru: 3. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Разрешить фоновую активность

# manufacturerSettingsOxygenosTitle
source: OxygenOS Settings for Stable Operation
ru: Настройки OxygenOS для стабильной работы

# manufacturerSettingsOxygenosMessage
source: On OnePlus devices, you need to configure the following settings:
ru: На устройствах OnePlus необходимо настроить следующие параметры:

# manufacturerSettingsOxygenosStep1
source: 1. Autostart: Settings → Apps → Autostart → Enable for {appName}
ru: 1. Автозапуск: Настройки → Приложения → Автозапуск → Включите для {appName}

# manufacturerSettingsOxygenosStep2
source: 2. Battery optimization: Settings → Battery → Battery optimization → {appName} → Don't optimize
ru: 2. Оптимизация батареи: Настройки → Батарея → Оптимизация батареи → {appName} → Не оптимизировать

# manufacturerSettingsOxygenosStep3
source: 3. Background activity: Settings → Apps → {appName} → Battery → Allow background activity
ru: 3. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Разрешить фоновую активность

# manufacturerSettingsFuntouchosTitle
source: FuntouchOS/OriginOS Settings for Stable Operation
ru: Настройки FuntouchOS/OriginOS для стабильной работы

# manufacturerSettingsFuntouchosMessage
source: On Vivo devices, you need to configure the following settings:
ru: На устройствах Vivo необходимо настроить следующие параметры:

# manufacturerSettingsFuntouchosStep1
source: 1. Autostart: Settings → Apps → Autostart → Enable for {appName}
ru: 1. Автозапуск: Настройки → Приложения → Автозапуск → Включите для {appName}

# manufacturerSettingsFuntouchosStep2
source: 2. Battery optimization: Settings → Battery → Battery optimization → {appName} → Don't optimize
ru: 2. Оптимизация батареи: Настройки → Батарея → Оптимизация батареи → {appName} → Не оптимизировать

# manufacturerSettingsFuntouchosStep3
source: 3. Background activity: Settings → Apps → {appName} → Battery → Allow background activity
ru: 3. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Разрешить фоновую активность

# manufacturerSettingsFlymeTitle
source: Flyme Settings for Stable Operation
ru: Настройки Flyme для стабильной работы

# manufacturerSettingsFlymeMessage
source: On Meizu devices, you need to configure the following settings:
ru: На устройствах Meizu необходимо настроить следующие параметры:

# manufacturerSettingsFlymeStep1
source: 1. Autostart: Settings → Apps → Autostart → Enable for {appName}
ru: 1. Автозапуск: Настройки → Приложения → Автозапуск → Включите для {appName}

# manufacturerSettingsFlymeStep2
source: 2. Battery optimization: Settings → Battery → Battery optimization → {appName} → Don't optimize
ru: 2. Оптимизация батареи: Настройки → Батарея → Оптимизация батареи → {appName} → Не оптимизировать

# manufacturerSettingsFlymeStep3
source: 3. Background activity: Settings → Apps → {appName} → Battery → Allow background activity
ru: 3. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Разрешить фоновую активность

# manufacturerSettingsOneuiTitle
source: One UI Settings for Stable Operation
ru: Настройки One UI для стабильной работы

# manufacturerSettingsOneuiMessage
source: On Samsung devices, it is recommended to configure the following settings:
ru: На устройствах Samsung рекомендуется настроить следующие параметры:

# manufacturerSettingsOneuiStep1
source: 1. Battery optimization: Settings → Apps → {appName} → Battery → Don't optimize
ru: 1. Оптимизация батареи: Настройки → Приложения → {appName} → Батарея → Не оптимизировать

# manufacturerSettingsOneuiStep2
source: 2. Background activity: Settings → Apps → {appName} → Battery → Background activity → Allow
ru: 2. Фоновая активность: Настройки → Приложения → {appName} → Батарея → Фоновая активность → Разрешить

# manufacturerSettingsOneuiStep3
source: 3. Autostart: Usually not required on Samsung, but you can check in app settings
ru: 3. Автозапуск: Обычно не требуется на Samsung, но можно проверить в настройках приложения
